{"data":{"markdownRemark":{"id":"576215d5-9945-5b22-8db2-be0358de1b86","html":"<p>Amo desafios e uma boa inovação, mas sempre acompanhado de uma boa tecnologia para deixar tudo mais eficiênte.</p>\n<p>Comecei meu caminho na área tecnológica em 2012, com a entrada no curso Técnico em Informática do SENAI, lá obtive conhecimento em algumas linguagens de programação (Java, C# e SQL).</p>\n<p>No fim de 2013, antes de terminar o curso técnico, comecei a estudar por conta o desenvolvimento para dispositivos móveis, então busquei conhecer algumas linguagens (Java ME e Java para Android) e ferramentas (Unity 3D e Android Studio). Foi então que comecei a trabalhar na Elemento Visual como front-end.</p>\n<p><img src=\"/media/senai.jpg\" alt=\"Evento do SENAI\"></p>\n<p><em>Em maio de 2015 entrei no SENAI Londrina como desenvolvedor de projetos inovadores, onde atuei na área de desenvolvimento mobile.</em></p>\n<p>Comecei como desenvolvedor Android em Java, onde consequi aprimorar meu conhecimento e aplicá-lo no mercado. Com o tempo, novas tecnologias foram surgindo na área de desenvimento mobile, então comecei a aprender e desenvolver projetos com Xamarin em C# e React-Native em Javascript.</p>\n<p>Em dezembro de 2018, me formei em Ciência da Computação na UNIFIL. </p>\n<ul>\n<li>TCC: Com o título “Segurança na Comunicação de Dispositivos Wearables”, avaliei alguns métodos de segurança e suas aplicações atualmente em dispositivos wearables.</li>\n<li>Estágio: Com o título “Será que Chove?”, desenvolvi um app mobile em React-Native, com o objetivo de otimizar o tempo de planejamento do roteiro de viagem de um consultores de T.I.    </li>\n</ul>\n<p>Depois de formado e 4 anos de SENAI, em abril de 2019 entrei no Muffato, como desenvolvedor mobile com React-Native.</p>\n<p>Estou sempre buscando aprender as tecnologias atuais, que possam trazer mais eficiência e qualidade no meu dia a dia.</p>","frontmatter":{"title":"Sobre mim","date":null,"description":null}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"/pages/about/"}}